finish diagramming
